{     "data": "Roliga Spel och Dess Hemligheter Gymnasierarbete av Simon Hyttfors och Michael RehnSammanfattning Gymnasiearbete 2015 Roliga Spel och Dess Hemligheter Michael Rehn, Simon Hyttfors Godkänt: Examinator: Handledare: Caroline Boman Vad är hemligheten bakom ett roligt spel? Arbetet har undersökt denna fråga och har genom att tillämpa mantrat ”learning-by-doing” utvecklat ett spel vars enda syfte var att finna ett svar. Med hjälp av en enkät och en testgrupp har arbetet försökt att finna de gemensamma faktorer i detta flyktiga recept. 2Abstract Secondary Education Thesis 2015 The Secrets Behind Enjoyable Games Michael Rehn, Simon Hyttfors Approved: Examiner: Supervisor: What is the secret behind an enjoyable game? The thesis has analysed this field and through the “learning-by-doing” mantra, a game has been developed with the intention of seeking an answer to this question. By using a survey along with a test group, the aim of this work has been to find the common denominator in this elusive recipe. 3Förord Använd 12 pt Times New Roman, kursiv stil och 6 pt före och 12 pt efter, för att beskriva detta kapitels innehåll i två eller tre rader med raka höger- och vänsterkanter. Detta är rätt ställe att tacka för hjälp, råd, samarbete och inspiration för det presenterade projektet. Detta kapitel, som är valfritt, skrivs med Times New Roman, 12 pt och 6 pt för, med raka höger- och vänsterkanter. Lämna två tomma rader innan texten. Förordet avslutas lampligtvis med de båda raderna Namn och Plats, månad och år. Dessa båda rader skrivs med Times New Roman 12 pt och högerjusterat. Namn–raden skall ha 36 pt före, medan Plats, månad och år skall ha 12 pt före. Namn Plats, månad och år 4Nomenklatur Förkortningar Förkortning Förklaring NPC Non-player character. Karaktärer i spelvärlden som inte styrs av datorn istället för en spelare. Begrepp Begrepp Beskrivning Lagg, Lagga Från engelskans lag, som betyder eftersläpa eller fördröja, och syftar på att någon teknik är långsammare än vad den egentligen bör vara. Pixelkonst En slags grafisk formgivningsteknik som bygger på låg upplösning, så att konstnären arbetar på pixelnivå. Textur En bild som projiceras på en yta i spelet för att ge objektet ifråga ett utseende. Leveldesign Hur ett spels värld, eller level, är byggd. Det vill säga terrängen, skyltar som hjälper dig, karaktärer att prata med, bakgrund och så vidare. Alltså designen för hur spelvärlden porträtteras. Kontrollschema Den uppsättning av tangenter/annan hårdvara som använda för att interagera med spelet, t.ex. mellanslag för att hoppa och piltangenter för att gå. Texturpaket En samling texturer som ersätter spelets standardtexturer för att skapa ett skräddarsytt utseende för spelet. 5Innehållsförteckning Sammanfattning....................................................................................................................................2 Abstract.................................................................................................................................................3 Förord...................................................................................................................................................4 Nomenklatur.........................................................................................................................................5 Förkortningar..............................................................................................................................5 Förkortning.............................................................................................................................5 Förklaring...............................................................................................................................5 Begrepp.......................................................................................................................................5 Begrepp..................................................................................................................................5 Beskrivning............................................................................................................................5 Innehållsförteckning.............................................................................................................................6 1 Introduktion.......................................................................................................................................8 1.1 Bakgrund....................................................................................................................................8 1.2 Syfte...........................................................................................................................................8 1.3 Avgränsning...............................................................................................................................8 1.4 Metod.........................................................................................................................................9 2 Genomförande.................................................................................................................................10 2.1 Teknisk del...............................................................................................................................10 2.1.1 Programmering.................................................................................................................10 2.1.2 Finslipning.......................................................................................................................10 2.2 Visuell del................................................................................................................................11 2.2.1 Terräng..............................................................................................................................11 2.2.2 Karaktärer.........................................................................................................................12 2.3 Spelvärldsdel............................................................................................................................12 2.3.1 Leveldesign......................................................................................................................12 2.3.2 Handling...........................................................................................................................13 2.3.3 Musik och Ljud................................................................................................................13 3 Resultat............................................................................................................................................15 3.1 Generell del..............................................................................................................................15 3.2 Specifik del..............................................................................................................................15 3.2.1 Teknisk del.......................................................................................................................15 3.2.2 Visuell del.........................................................................................................................15 3.2.3 Spelvärldsdel....................................................................................................................15 4 Diskussion och Sammanfattning.....................................................................................................16 4.1 Diskussion................................................................................................................................16 4.1.1 Teknisk del.......................................................................................................................16 4.1.2 Visuell del.........................................................................................................................16 4.1.3 Spelvärldsdel....................................................................................................................16 4.1.4 Generell del......................................................................................................................17 4.2 Sammanfattning.......................................................................................................................17 4.3 Slutsats.....................................................................................................................................18 5 Referenser........................................................................................................................................19 Bilagor................................................................................................................................................20 Bilaga 1..........................................................................................................................................20 Bilaga 2..........................................................................................................................................20 Bilaga 3..........................................................................................................................................20 Bilaga 4..........................................................................................................................................20 Bilaga 5..........................................................................................................................................21 Bilaga 6..........................................................................................................................................21 6Bilaga 7..........................................................................................................................................21 Bilaga 8..........................................................................................................................................22 Bilaga 9..........................................................................................................................................22 Bilaga 10........................................................................................................................................22 Bilaga 11........................................................................................................................................22 71 Introduktion 1.1 Bakgrund I flera år har vi båda intresserat oss för spelutveckling av olika sorter, stora projekt som små. Vi har inspirerats av historien om det svenska spelet Minecraft, vilken jag tvivlar på att någon gått miste om. Just indiespel har inspirerat oss särskilt mycket, att helt själva stå för produktionen av kod, såsom texturer, musik och ljudeffekter. Indiespel har vuxit alltmer de senaste åren, dessa spel är oftast gjorda med en låg budget och ett litet team, men trots det lyckas spelen gång på gång överraska och underhålla publiken. Att vi själva börja följa fotspåren av dessa indieutvecklare är därför inte speciellt konstigt 1.2 Syfte Spelindustrin har exploderat och fortsätter att växa kraftigt. Ett exempel är att spelindustrins omsättning har ökat med drygt 70 % på bara tre år, mellan 2012 och 2015, enligt Gartner (Gartner, 2015-01-28). Spelmarknaden verkar således vara långt ifrån saturerad och där det finns pengar, finns det personer villiga att investera. Mängden av aktörer och därmed spel har ökat; konkurrensen är hårdare inom spelindustrin än tidigare förr. En fråga som då uppstår är följande: hur får en aktör just sitt spel att stå ut bland mängden? En enkel fråga fast med ett mycket svårt, och framförallt ointressant, svar. Det finns självklart en välkänd metod: marknadsföring. Marknadsföring har använts i århundraden in och århundraden ut, men utan en stabil och bra produkt, blir den lönlös och personens i frågas produkt blir bortglömd. Från den ovannämnda frågeställningen kan vi istället härleda någonting mer intresseväckande: hur gör du en produkt bra? I spelindustrin är svaret självklart: spelet ska vara roligt att spela. Problemet finner vi dock i att rolig är ett epitet som för människan är högst subjektivt. Men trots det finns det till synes ett hemligt recept, eftersom det finns spelföretag som gång på gång lyckas publicera lyckade spel – ett mycket noterbart exempel är den japanska spelutvecklaren Nintendo. Är Nintendos framgångar endast baserade på ren tur och/eller skicklig marknadsföring, eller finns det ett hemligt recept för att utveckla ett roligt spel? 1.3 Avgränsning Ett spel kan ta mängder av former, beroende på genre, målgrupp etc. Detta arbete kommer dock endast beröra plattformsspel i två dimensioner, det vill säga spel där spelmiljön är ungefär som en teaterscen sett från en åskådares perspektiv. Detta främst för enkelhetens skull – för en person som inte är insatt i spelutvecklingen, så är det avsevärt mycket enklare att utveckla tvådimensionella spel än tredimensionella – men även för estetikens skull. Ett simpelt plattformsspel med lågupplösta texturer, så kallad pixelkonst, tror vi kan bidra till spelets charm. Vi kommer även att endast fokusera på indiespel. Angående avgränsning till bedömningen av resultatet har vi bestämt oss för att definiera ”ett roligt spel” som ett spel med höga spelarsiffror och god kritik. Vi kan anta att ett spel som lyckas sälja 8mycket är roligt då det är ett konkret bevis på att många människor uppenbarligen vill spela spelet ifråga. Detta innebär dock inte att ett spel med låga säljarsiffror är ”tråkigt”, ett spels framgång har mängder av faktorer som spelar in för att det ska sälja. Ett spel kan exempelvis vara hur roligt som helst, men utan skicklig marknadsföring kommer det ändå inte sälja. Därför skulle ett mer pålitligt mått vara att endast lyssna på kritiken. 1.4 Metod Frågeställning är en som till synes kan vara svår att tackla men det finns två uppenbara vinklar där den ena må vara mer iögonfallande för akademikern och där den andra finner sig hemma hos ingenjören. Akademikern angriper frågan genom att undersöka de självklara roliga spel som redan finns eller har funnits på marknaden och jämför dem; de letar efter något gemensamt mönster eller egenskap som utmärker dessa spel. Ingenjören följer istället mantrat ”Learning-by-doing” som menar att en bäst lär sig genom att göra och lära sig från sina misstag. Detta arbete har till stor del genomförts via ingenjörens väg och har alltså skapat ett spel från grunden där det som är roligt är baserat på antagningar och hypoteser ifrån utvecklarna – denna process är ”doing”. Här kommer löpande återkoppling från en spelintresserad stödgrupp spela stor roll – denna process är ”learning”. Trots det har akademikerns metoder inte fallit i glömska. En enkät kommer att skickas ut i samband med våra speltester där vi samlar information om vad som gjorde spelet roligt samt mindre roligt. Det är resultatet av denna enkät som ska leda oss till att svara på arbetets frågeställning. Ett spel är ett stort projekt bestående av mindre individualiserade delar. För att förenkla och effektivisera utvecklandets gång har vi därmed varit noga att behålla tydliga gränser. Vi förväntar oss att konsekvensen till denna inkapsling är att respons blir enklare att bearbeta, då det annars kan vara svårt att förmedla kritik någorlunda konstruktivt eftersom det är svårt att bedöma en liten del ur en helhet. De starkaste gränserna vi drog var mellan den tekniska delen, den visuella delen och spelvärldsdelen. 92 Genomförande 2.1 Teknisk del Den tekniska delen är, för att sammanfatta, delen av arbetet som är utförd på den tekniska nivån. Det vill säga delen som inte är synlig för användaren och som sköter allting bakom kulisserna. Den tekniska delen består alltså till stor del av programmering. Men den tekniska delen innefattar inte endast programmering. Efter att programmeringen är avklarad så finns det mycket finslipande att göra, ändra hastigheten en karaktär kan springa eller vilka kontroller som används, och så vidare. Därför är detta avsnitt uppdelat i två delar; programmering och finslipning. 2.1.1 Programmering Det första uppdraget att klara av när ett spel ska utvecklas är att bestämma plattform och programmeringsspråk. Plattform är i detta fall vart någonstans spelet kommer att kunna spelas: mobiler eller på datorn, i webbläsaren eller i en skrivbordsapplikation, på Windows eller Mac. Vi anser att denna punkt är oerhört relevant i åtanke på arbetets frågeställning. För det första så måste programmeraren i fråga vara bekväm med att arbeta med det valda programmeringsspråket och den valda plattformen; om inte programmeraren är van löper risken stor att slutprodukten blir halvdan och att spelaren inte uppfattar spelet som roligt på grund av bristande kvalité. För det andra bör spelet nå ut till så många som möjligt med så lite friktion som möjligt; om endast väldigt få kan pröva spelet förlorar den sin mening och om det är för mycket strul och krångel att kunna spela spelet förlorar den sin attraktivitet. Punkt 1 är den punkt som utesluter flest alternativ och efter uteslutandet är det två programmeringsspråk kvar att välja mellan: C# eller JavaScript. I åtanke på punkt 2 är JavaScript det mest attraktiva programmeringsspråket är eftersom: 1. Det kan köras överallt; på mobilen eller på datorn, på Windows, Max eller Linux, med fler. Detta gör att fler kan spela spelet och ge respons. 2. Det kan köras utan att användaren behöver ladda ner någonting. Detta minskar friktionen när användaren ska pröva spelet och lockar således fler till att pröva och ge respons. 2.1.2 Finslipning Att få spelet att kännas rätt var för skaparna av det kritikerrosade spelet Super Meat Boy ett arbete som bestod av mycket testande och finslipande, med andra ord ett mycket tidskrävande arbete (McAllister, Gillen. 2015-02-15). Borde karaktären springa snabbare eller långsammare? Borde karaktären hoppa högre eller lägre? Borde musiken låta mer eller mindre relativt till ljudeffekternas volym? Dessa var frågor utvecklarna ställde sig under arbetets gång. Att tänka sig att allt det här påverkar spelarens försjunkenhet i spelet är inte speciellt konstigt; om ett mycket högt ljud, som spelaren inte anser borde vara högt, kan försjunkenheten i spelet avbrytas. Varför arbetet har tagit en spelares försjunkenhet i spelet är då det är viktigt för hur mycket nöje en spelare finner i spelet (Brown, Emily, and Paul Cairns. 2015-02-15). För att återkoppla mantrat ”Learning-by-doing” till ett konkret exempel har många värden för volym/hastighet/hoppstyrka, och så vidare, valts på måfå, någonting som utvecklaren tyckte kändes rimligt. Problemet med den här infallsvinkeln är att det 10ska verka rimligt för så många olika spelare som möjligt, inte bara den som programmerade. Därför har detta angreppssätt kompletterats med den löpande feedbacken vi mottagit från vår stödgrupp. 2.2 Visuell del Den visuella delen är det direkt synliga för spelaren. Det första spelaren möts av när då denne öppnar sidan, karaktärernas och terrängens utseende inuti spelet, pausskärmen och inställningarnas layout samt läsbarhet. Detta moment involverar mest ritande av diverse texturer men även en del planerande, delvis för att åstadkomma ett bra utseende sett från ett estetiskt perspektiv, men även ett tilltalande gränssnitt som är lätt att förstå för spelaren. Det finns många faktorer att hålla i åtanke vid speldesign för plattformsspel. Först och främst blev vi tvungna att välja vilken upplösning vi skulle hålla oss till. Olika upplösningar på texturerna har alla sina fördelar. Högre upplösning är givetvis bra för att du har större arbetsyta och därmed tillgång till mer detaljerade texturer. De tar dock längre tid och är mer ansträngande att göra. Mindre texturer tar går mycket snabbare att skapa, då det är färre pixlar som ska ritas. Det kan dock vara svårt att uttrycka sig som önskat med färre pixlar, men om en lågupplöst textur blir lyckad så ser den oftast mycket mer personlig och vänlig ut. Med tids- och arbetsprocessen samt den estetiska delen i åtanke, gjorde vi valet att använda oss av lågt upplösta texturer. För att gå mer djupgående in på pixelkonst kan begrepp som färgpalett och dithering nämnas. En färgpalett kan begränsas till ett litet antal färger för att åstadkomma lite av en retrokänsla som påminner om grafiken hos spel från 80- och 90-talet då datorerna ännu inte stödde större färgpaletter. Dithering är tekniken som används för att skugga texturer med en begränsad färgpalett, utan att utöka den sistnämnde. Då vi varken hade tid eller kunskap för att använda oss av några av dessa tekniker, gjorde vi heller inte det. 2.2.1 Terräng Upplösningar för ”blocks” som är utseendet vi använder oss av delas vanligtvis in i tal med två som bas, exempelvis 16x16 (2^4), 64x64 (2^6) och 128x128 (2^7). Den första siffran framför ”x” indikerar bredden i pixlar på texturen, talet efteråt indikerar höjden. Det är inte tvång på att använda sig av dessa dimensioner, men vanligtvis brukar de följas. Vi valde att rita våra blocks med upplösningen 16x16. Ett spels terräng måste vara tilltalande för spelaren, det måste se spännande ut. Spelaren ska få lust att utforska spelvärlden om ens bara för att se hur resten av terrängen kommer att se ut. Till och börja med måste det väljas en färg som grund till blocket ifråga. Vi tar texturen för berggrund som ett exempel. Ett enkelt misstag här skulle kunna vara att välja en enkel grå nyans, för att sten är grått. För att få terrängen att kännas mer personlig och berätta en historia valde vi istället en lite mer rödaktig nyans av grå. Det skulle få stenen att se gammal ut, som att den håller på att korrodera och bli till jord. Se bilagor: Bilaga 1, Bilaga 2 , Bilaga 3 och Bilaga 4: Skulle bara en simpel enfärgad textur användas så skulle all area täckt av berggrund se ut som ett enda parti av exakt samma färg, otroligt tråkigt. Detta kan åtgärdas via detaljer. Men att bara lägga till detaljer i en annan nyans kommer bara förvärra situationen. Det som behövs är brus i texturen, det vill säga en större mångfald av färger, eller rättare sagt nyanser. Detaljer ska förresten behandlas med försiktighet, om bara en och samma textur används för samma block och alla dessa innehåller samma detaljer, så 11kommer alla stenpartier se repetitiva ut, och det ser inte bra ut. Ett undantag för detta är blocks som avsiktligt ska se repetitiva ut, exempelvis texturen för mursten. Den ska föreställa en mur som fortsätter gå åt bägge håll och får absolut inte se osammanhängande ut. Se Bilaga 5. 2.2.2 Karaktärer Karaktärer är oftast svårare än terräng att rita, främst för att de kräver mer detaljer. Detta beror på att du som spelare fokuserar på karaktärerna i spelet och egentligen inte terrängen. Terrängen ska finnas där i bakgrunden för att ge inlevelse, men karaktärerna är det spelet kretsar kring. Spelaren styr huvudkaraktären och kameran följer efter denne – spelet kretsar bokstavligen kring huvudkaraktären – du interagerar med andra karaktärer genom spelet och det är egentligen detta hela handlingen bygger på. Det är därför väsentligt att just karaktärerna ser bra ut. För att karaktärerna ska se bra ut måste de stämma in med resten av stilen. Detta har vi haft i åtanke och bara använt matta färger, likt de i terrängen. Vi har även lagt till brus i karaktärerna för att ge dem ett lite hårdare och på något sätt verklighetstroget utseende. Även fast det är självklart att karaktärerna inte ser det minsta realistiska ut så är det viktigt att ge dem den känslan. Brus i texturen är ett väldigt bra sätt att framställa denna effekt. Eftersom det inte finns gott om plats för detaljer i så lågupplösta texturer som vi använder så är det nödvändigt att utesluta de onödiga detaljerna. Ta ansiktet på en karaktär till exempel. En mun går att utesluta och fortfarande bibehålla ett acceptabelt ansikte. Ögonen går däremot inte att utesluta. Detta eftersom vi människor lägger mer fokus på en individs ögon än någon annanstans i ansiktet (Janik, Stephen W. 2015-02-20). För att slutligen ge karaktären en sista levande känsla är en animation nödvändig. En animation gör om den tidigare stillbilden av karaktären till något som kan liknas med en filmstrip. En sammansatt rad av flera olika bilder på karaktären i olika positioner då denne exempelvis springer framåt. När animationen sedan spelas upp då karaktären rör sig framåt, ser det ut som att denne springer. Utan animation skulle karaktären se ut som en livlös docka som svävar fram över marken. Animationer är viktiga för spelarens njutning av spelet, då det ger denne en högre form av respons från karaktären, mer än att den rör sig framåt. 2.3 Spelvärldsdel Spelvärldsdelen är världen som karaktären spelaren styr befinner sig i. Här kan vi dels finna den terräng spelaren går på, handlingen i spelet samt de ljud och den musik som spelaren hör. Detta avsnitt är således grupperad utefter denna indelning. 2.3.1 Leveldesign Leveldesignen även den mycket viktigt för att ett spel roligt, åtminstone enligt Cliff Bleszinski från spelutvecklaren Epic Game, som poängterar i ”The art and science of level design” att om spelaren innehar en känsla av frihet och kontroll i spelet upplevs det roligare (Bleszinski, Cliff, and Epic Games. 2015-02-15). Att skapa en värld är minst lika svårt som att måla en tavla; du ska skapa någonting från ingenting, från en tom kanvas. Det är även, för att fortsätta med analogin, svårt att börja men lätt att fortsätta. Därför angreps leveldesignen likt konstnärens sätt att måla: tänk inte – utan gör. Världen ritades först ut för hand på ett papper, för att sedan infogas i världen med vår egen datorskapade konst. Resultatet av den handritade och den datorgenerade världen kan ses i Bilaga 6. 12Att bara göra, istället för att tänka, må vara bra för att få fram någonting överhuvudtaget, men det lär inte vara skapat på det sättet att det gör ett spel roligare. Vi, utvecklarna, kan alltid utgå från vad vi skulle tycka skulle vara roligt, men det representerar sällan det övriga spelare tycker; utvecklarna är oftast partiska och förlorar snabbt sin objektiva syn på spelet. Därför är, återigen, den löpande feedbacken från vår stödgrupp viktigt. På grund av detta är världen något av det som kommer att ändras som mest under spelets utveckling, det är viktigt att våga lite på feedback och att våga ta bort sådant du tidigare trodde var en bra idé, eller som Arthus Quiller-Couch sa: ”Murder your darlings” (Quiller-Couch, Arthus. 2015-02-15). Vi ville ha en stor värld med mycket frihet, och det skapade vi. Men kan spelaren få för mycket frihet, i det sinne att spelaren inte vat vart hen ska ta vägen? Lösningen skulle vara att leda spelaren dit hen behövde gå, utan att säga det rakt ut. Detta skedde med två olika hjälpmedel, NPCs (Non- player characters) och skyltar. Du kunde alltså prata med alla NPCs i världen, som ibland gav tips på vart du kunde hitta den där prylen någon letade efter, eller kanske hur du ska göra för att ta dig förbi ett speciellt ställe. Skyltar fanns för att visa ”här finns någonting”, eller kanske rent av att du ska ”akta dig”; se Bilaga 7. 2.3.2 Handling Spelets handling är en punkt som för oss kom till glömska när spelet utvecklades. Först och främst kom vi att tänka på olika roliga funktioner, hur spelet ska se ut, och så vidare. Vi tror dock att spelaren gärna vill veta historien bakom karaktären den spelar, varför karaktären befinner sig där den är just nu och varför karaktären gör som den gör. Utan en handling uppstår många frågor och risken finns att det inte uppstår något driv; varför ska spelaren fortsätta spela om det inte finns någon anledning till att ta sig vidare? Med det sagt så behöver ett spel inte vara mindre kul för att det inte finns någon handling, så länge spelets funktioner överskuggar den förutnämnda frågan blir den irrelevant. Handlingen till arbetets spel utvecklades i samband med intensiva brainstorming-sessioner. Vi hade alltså ingen grundidé från början utan formade handlingen så att den passade in till alla de roliga funktioner som spelet ska ha. Istället för att svara på de många frågor som uppstår undvek vi dem genom att fastställa i början av spelet att inte ens karaktären vet varför den är där hen är, se Bilaga 8. Vi är trots allt tekniker och inte sagoberättare. Denna lösning gav oss, förutom att inte behöva besvara på de miljontals frågor som uppstår, stor frihet till att skapa en fiktiv värld där spelaren är minst lika förvånad och överraskad som karaktären hen spelar. Resten av handlingen tillkom naturligt då vi hade skurit loss oss från behovet att svara på ”varför”. 2.3.3 Musik och Ljud Utvecklarna under arbetets gång försökte använda sig av musik och ljud för att höja graden av försjunkenhet i spelet, som vi redan fastställt påverkar hur mycket nöje en spelare finner i spelet (Brown, Emily, and Paul Cairns. 2015-02-15). Om spelaren möter någonting läskigt ska en läskig melodi spela, och om spelaren går in i en kuslig tunnel bör en mystisk musik spelas. Spelaren ska även höra fotsteg när hen går, hoppljud när hen hoppar och ett duns när hen landar på marken högt uppifrån, ett litet ”du gjorde det!”-ljud när en klarar ett svårt uppdrag. Detta är dels för att ge respons till spelaren att något faktiskt hänt och dels ett försök att stimulera belöningssystemet i hjärnan, någonting vi tror kan göra att spelaren upplever spelet roligare. 133 Resultat Enkäten som lämnades ut i samband med speltestande av arbetets spel ställde frågor dels i avseende med vad spelaren tyckte om spelet, samt hur mycket de individuella delarna påverkade spelet. Utifrån denna data bör vi kunna se vad som lyfte spelet, respektive vad som sänkte spelet, och på så sätt ta reda på vad som gjorde spelet kul/inte kul. Totalt fick vi 72 svar på enkäten. Detta avsnitt kommer att behandla de väsentliga och intressanta svaren i undersökningen – kompletta svar kan finnas i Bilaga 9. 3.1 Generell del Innan respondenten fick svara på mer specifika frågor fick denne svara på vad hen tror är påverkar sin upplevelse mest. Svarsalternativen var följande: musiken, spelstil och leveldesign, handlingen, kontrollerna, grafiken, ljudeffekterna samt övrigt. Utav dessa var spelstil och leveldesign kraftigt överrepresenterat med rungande 54 % där tvåan, kontrollerna, halkade efter med knappa 17 %. Se Bilaga 10 för kompletta resultat. 3.2 Specifik del Vi frågade hur mycket de olika områdena (teknik-/visuell-/spelvärldsdel) påverkade ens njutning av spelet där svarsalternativen löpte från 0, det påverkade inte min njutning alls, till 4, det påverkar min njutning väldigt mycket. För att lättare få en överblick över vad som påverkade mest har samtliga svar sammanställts till ett medelvärde där högst nummer betyder att området påverkade njutningen av spelet mycket, och där lågt nummer betyder att området påverkade njutningen av spelet lite. Samtliga resultat kan finnas i Bilaga 11. 3.2.1 Teknisk del Den tekniska delens område beskrevs i enkäten som ”kontroll och känsla” och fick ett medelvärde på 2,64. 3.2.2 Visuell del Den visuella delens område beskrevs i enkäten som ”konststil” och fick ett medelvärde på 2,75. 3.2.3 Spelvärldsdel Spelvärldsdelen var mest omfattande och delades i enkäten upp till ”musik”, ”ljudeffekter”, ”spelstil och leveldesign” och ”handling”. För att sammanfatta så påverkade ”spelstil och leveldesign” spelet mest med ett medelvärde på 3,15, och det som påverkade spelet minst var ”ljudeffekter”, tätt följt av ”handling”, med ett medelvärde på 2,29 respektive 2,31. 144 Diskussion och Sammanfattning 4.1 Diskussion Eftersom spelet designades med olika delområden inkapslade så kommer även resultaten att diskuteras samt analyseras i samma inkapsling vi har använt förut. 4.1.1 Teknisk del En av anledningarna till att vi valde JavaScript som plattform var eftersom vi är vana vid programmeringsspråket och kunde således utveckla spelet utan att få en halvdan produkt med bristande kvalité. Trots vår erfarenhet är det självklart att så kallade buggar, det vill säga delar i koden som innehar ett oavsiktligt beteende, dyker upp; 19 % av de som spelade nämnde att de hade stött på en bugg men tur nog var det bara 3 % av de som spelat som kände att buggen påverkade deras njutning av spelet mycket. Att siffran var så pass låg är nog tack vare vår erfarenhet av programmeringsspråket som kunde förutse och hindra buggar som påverkar spelet mycket. Men det är viktigt att inte glömma att det trots allt var en femtedel som märkte att spelet inte uppförde sig som förväntat. Ett perfekt spel ska enligt oss hålla denna siffra så nära 0 % som möjligt. En möjlig lösning, som även vissa av de som svarade på enkäten föreslog, att testa spelet mer, med en större grupp, för att jaga ner alla buggar innan spelet släpps till massorna. Kontrollerna och känslan var något som påverkade spelets njutbarhet mycket, enligt de som svarade på enkäten. Att då endast 53 % tyckte att kontrollerna kändes naturliga och att 38 % tyckte att kontrollerna kändes nervösa var för oss en stor miss; flera av de som svarade på enkäten tyckte att kontrollschemat borde ha varit mer genomtänkta och att mer finslipning borde ha genomförts för att få, för att citera respondenten, kontrollerna mer ”tight”, alltså stramare kontroll över karaktären. Vi förutspådde innan och visste under tiden av arbetet, att finslipning tar tid. Att vi inte riktigt lyckades nå perfekt känsla och kontroll är kanske därför inte speciellt konstigt med tanke på den begränsade tid vi hade på att utveckla spelet. Båda dessa punkter gällande kontroll kan lösas med hjälp av samma metod, nämligen mer testande, mer respons och mer finslipande – det tar tid, ha tålamod! 4.1.2 Visuell del Majoriteten av spelarna tyckte att pixelkonst var antingen en passande eller väldigt passande designstil, precis som vi planerat. Anledningen till att vi valde att designa i just pixelkonst var delvis för att de flesta plattformsspelen använder sig av pixelkonst. Konststilen fick också ett medelbetyg på 2,75/4 i frågan hur mycket spelaren tyckte om den. Trots ett relativt bra betyg så spelade det inte så stor roll, med tanke på att bara 10 % ansåg att konststilen var viktigt för hur spelupplevelsen i ett plattformsspel. Däremot ansåg hela 17 % att konststilen var det de tyckte mest om i spelet, vilket är en ganska lyckad siffra. Det var många respondenter som gav kritik angående bristen på varierande texturer. Detta försökte vi att motverka genom att skapa texturer som inte skulle se upprepande ut, vilket tidigare nämndes. Uppenbarligen lyckades vi dessvärre inte tillräckligt bra på den fronten. Detta är en faktor som kanske skulle kunnat påverka försjunkenheten i spelet åt det positiva och vi anser därför, i efterhand, att detta var en aspekt vi skulle lagt ned mer tid på. Det skulle kunnat förbättras på olika sätt. Bättre ritade texturer, fler olika texturer för samma material och så vidare. 15En annan punkt vi fick återkommande kritik om var att texturerna påminde starkt om Minecrafts utseende. Vi tänkte själva ofta på detta genom arbetsprocessen men drog slutsatsen att det är svårt att få pixelkonst att inte likna Minecraft. Detta på grund av att Minecraft är det mest kända exemplet på ett nutida spel som anammat pixelkonst. Vi hävdar således att det inte spelar någon roll hur vi gjort texturerna. Eftersom de har samma upplösning som Minecrafts texturer, samt bygger på verklighetsinspirerade ting så skulle de med stor sannolikhet alltid se ut som Minecraft. Det faktumet att Minecraft dessutom tillåter så kallade texturpaket, vilket innebär att du kan ladda ned olika utseenden till spelet, gör det inte lättare att skapa texturer som differentierar sig, på grund av den stora mångfalden av utseenden Minecraft kan anta. 4.1.3 Spelvärldsdel Att mer än hälften tyckte att spelstil och leveldesign påverkade ens njutning av ett tvådimensionellt plattformsspel mest är mycket intressant. Att detta resultat överensstämmer med det som spelaren faktiskt upplevde, då spelstil och leveldesign fick högst medelvärde, är ett dessutom ett bra tecken. Då spelstil och leveldesign påverkar spelet mest, är det således det viktigaste området att göra roligt; det är alltså spelstil och leveldesign som mest resurser ska allokeras till. Resultatet av vad spelare faktiskt tyckte om vår spelstil och leveldesign var positiv, men respondenterna lämnade en del gemensamma synpunkter. Vi ville skapa en stor värld, eftersom känslan av frihet skulle höja spelet, som vi tidigare nämnt. Det beslutet slog tillbaka. Eftersom världen var stor och innehållet ringa tyckte respondenterna att den kändes tom. Deras förslag var att fylla världen med mer intressanta och varierade ting. Slutsatsen som kan härledas från denna respons är att friheten vi ger spelaren är värdelös om det inte finns något att använda den till. Att istället ha en mindre, men mer sammanhängande samt dynamisk värld, skulle föredras. Musiken mottog någorlunda bra respons med det fanns ett genomgående tema av den respons vi tog emot: mer musik! Att spelet bara hade fem olika, och dessutom väldigt korta, melodier påverkade negativt. När musiken tog slut tyckte respondenterna att det kändes tomt, de hörde sin omgivning och deras försjunkenhet bröts, som vi tidigare nämnt varit viktig för njutningen av spelet! Eftersom kritiken enbart bestod av att det fanns för lite musik kan vi även dra slutsatsen att det inom detta område behövs göras ännu en undersökning för att faktiskt fastställa hur det påverkade spelaren. Ljudeffekterna ansåg flest folk var minst viktigast för hur roligt ett spel är, men ändå med ett betyg över mitten. Det fick ett mycket lägre värde än vad vi personligen hade trott, anledningen till varför vi överskattade resultatet återkommer vi till i ”5.1.4 Generell del”. Den kritik respondenterna gav angående ljudeffekter var att det borde ha funnits fler ljudeffekter för fler aktioner och att det borde ha varit tydligare varifrån ljudet kom ifrån. Detta tror vi är viktigt för att spelaren måste få respons på direkten, om något bra har hänt så spelas en glad melodi, och vice versa. Handlingen, likt ljudeffekterna, tyckte många spelade en mindre roll i hur roligt ett spel är. Slutsatsen här är faktiskt inte mer än så, då vi inte fick någon kritik eller respons på just spelets handling förutom att det var bra. 4.1.4 Generell del Generell respons angående spelet som helhet var att hitta sätt att differentiera spelet från andra. Detta är något vi håller med om. Att skapa det perfekta spelet är svårt, det finns alltid någon som kan göra det bättre än du. Om du istället differentierar spelet och gör någonting unikt, kan det locka 16spelare. Det är dessutom alltid roligt att pröva på någonting nytt. För att återkoppla till varför vi överskattade resultat i ljudeffekter är för att vi tror att ljudeffekter påverkar mer psykologiskt snarare än tydligt. Om så är fallet skulle spelarna således sakna ett omdöme som faktiskt kan betygsättas. För rensa någon tvivel bör två olika undersökningsgrupper spela spelet, där skillnaden mellan grupperna är att en får ha ljud, och den andra inte får ha ljud. Då kan den möjliga psykologiska effekten analyseras. Detta kallas för A/B-testande (Wikipedia, 2015- 02-19), där du prövar två olika versioner och avgör vilken version som är bäst beroende på resultatet från testerna. På grund av samma anledning, den möjliga psykologiska effekt som olika områden innehar på spelar, tror vi att flera av resultaten kan vara missvisande; många respondenter kanske till och med har gissat då de saknade en uppfattning. Därför borde vi ha använt denna metod av testande ha använts på samtliga punkter där vi vill se vilken metod är överlägsen. 4.2 Sammanfattning Ett genomgående tema vi kunde finna i responsen var ”variation”. Vi skulle ha varierande texturer, varierande uppdrag, varierande musik, fler ljudeffekter, varierande spelstil och varierande och dynamisk värld. Vårt spel saknade, enligt respondenterna, denna variation och vi kan således inte säga hur variation faktiskt påverkar hur roligt ett spel är. En undersökning med syfte att undersöka hur variation påverkar hur roligt ett spel är skulle därför vara eftersträvansvärt. I resten av responsen kunde vi även där finna ett mönster. Vi borde ha finslipat mer, på nästan alla punkter. Vi borde ha mer innehåll och variation, mer musik och mer ljudeffekter, vi borde differentiera oss mer genom att hitta på någonting unikt. För att sammanfatta, vi borde ha er tid. 4.3 Slutsats Nu är det alltså endast den första frågan kvar: finns det något hemligt recept för att göra roliga spel? Vi kan tydligt se i responsen vi fick att spelarna upplevde att olika områden var olika viktiga. Om dessa resultat överensstämmer med verkligheten är dock oklart då detta arbete inte tog möjliga psykologiska effekter i åtanke. Vi fann dock många misstag som vi själva gjorde på vägen där vanliga symtom innefattar, men inte är begränsat till, brist på variation och differentiering. Botemedlet tycks vara en hederlig dos av receptbelagd tid och slätt sandpapper. Vem som är tillåten att förskriva dessa läkemedel förblir dock ett mysterium för oss. 175 Referenser Bleszinski, Cliff, and Epic Games. \"The art and science of level design.\" 2000 Game Developers Conference Proceedings. 2000. Quiller-Couch, Arthur Thomas. On the art of writing: Lectures delivered in the University of Cambridge, 1913-1914. University Press, 1916. Gartner, Gartner Says Worldwide Video Game Market to Total $93 Billion in 2013. 29 Oct. 2013. <http://www.gartner.com/newsroom/id/2614915>. Brown, Emily, and Paul Cairns. \"A grounded investigation of game immersion.\" CHI'04 extended abstracts on Human factors in computing systems. ACM, 2004. McAllister, Gillen. Team Meat Vs The World: Part 1. 17 <http://www.gamereactor.eu/articles/5577/Team+Meat+Vs+The+World:+Part+1/? sid=9db9267df5ea1a880990e7a36dc36021> Nov. 2010. Wikipedia. A/B Testing. <http://en.wikipedia.org/wiki/A/B_testing> Janik, Stephen W., et al. \"Eyes as the center of focus in the visual examination of human faces.\" Perceptual and Motor Skills 47.3 (1978): 857-858. 18Bilagor Bilaga 1 Bilaga 2 Bilaga 3 Bilaga 4 19Bilaga 5 Bilaga 6 Bilaga 7 20Bilaga 8 Bilaga 9 Länk till bilaga: • https://www.dropbox.com/s/mk49jayp7hhkg44/Gymnasiearbete%20--%20Responsenk%C3%A4t %20%28Responses%29.xlsx?dl=0 Bilaga 10 Område Procentandel Musiken 3 % Spelstil och Leveldesign 51 % Handlingen 11 % Kontroll och känsla 6 % Konststil 10 % Ljudeffekter 0 % Övrigt 19 % Bilaga 11 Område 0 1 2 3 4 Medelvärde Musik 13 % 4 % 22 % 32 % 29 % 2,61 Ljudeffekter 13 % 7 % 36 % 28 % 17 % 2,29 Spelstil och 3 % Leveldesign 1 % 10 % 50 % 36 % 3,15 Handling 10 % 35 % 26 % 18 % 2,31 11 % Kontroll känsla och 6 % 10 % 26 % 32 % 26 % 2,64 Konststil 4 % 11 % 18 % 39 % 28 % 2,75 21" }